{"metadata":{"article":"Article 3","title":"Definitions","regulation":"Regulation (EU) 2024/1689 - EU AI Act","source":"https://eur-lex.europa.eu/legal-content/EN/TXT/HTML/?uri=CELEX:32024R1689","total_definitions":68,"extracted_date":"2026-01-12"},"definitions":[{"number":1,"term":"AI system","definition":"A machine-based system that is designed to operate with varying levels of autonomy and that may exhibit adaptiveness after deployment, and that, for explicit or implicit objectives, infers, from the input it receives, how to generate outputs such as predictions, content, recommendations, or decisions that can influence physical or virtual environments."},{"number":2,"term":"risk","definition":"The combination of the probability of an occurrence of harm and the severity of that harm."},{"number":3,"term":"provider","definition":"A natural or legal person, public authority, agency or other body that develops an AI system or a general-purpose AI model or that has an AI system or a general-purpose AI model developed and places it on the market or puts the AI system into service under its own name or trademark, whether for payment or free of charge."},{"number":4,"term":"deployer","definition":"A natural or legal person, public authority, agency or other body using an AI system under its authority except where the AI system is used in the course of a personal non-professional activity."},{"number":5,"term":"authorised representative","definition":"A natural or legal person located or established in the Union who has received and accepted a written mandate from a provider of an AI system or a general-purpose AI model to, respectively, perform and carry out on its behalf the obligations and procedures established by this Regulation."},{"number":6,"term":"importer","definition":"A natural or legal person located or established in the Union that places on the market an AI system that bears the name or trademark of a natural or legal person established in a third country."},{"number":7,"term":"distributor","definition":"A natural or legal person in the supply chain, other than the provider or the importer, that makes an AI system available on the Union market."},{"number":8,"term":"operator","definition":"A provider, product manufacturer, deployer, authorised representative, importer or distributor."},{"number":9,"term":"placing on the market","definition":"The first making available of an AI system or a general-purpose AI model on the Union market."},{"number":10,"term":"making available on the market","definition":"The supply of an AI system or a general-purpose AI model for distribution or use on the Union market in the course of a commercial activity, whether in return for payment or free of charge."},{"number":11,"term":"putting into service","definition":"The supply of an AI system for first use directly to the deployer or for own use in the Union for its intended purpose."},{"number":12,"term":"intended purpose","definition":"The use for which an AI system is intended by the provider, including the specific context and conditions of use, as specified in the information supplied by the provider in the instructions for use, promotional or sales materials and statements, as well as in the technical documentation."},{"number":13,"term":"reasonably foreseeable misuse","definition":"The use of an AI system in a way that is not in accordance with its intended purpose, but which may result from reasonably foreseeable human behaviour or interaction with other systems, including other AI systems."},{"number":14,"term":"safety component","definition":"A component of a product or of an AI system which fulfils a safety function for that product or AI system, or the failure or malfunctioning of which endangers the health and safety of persons or property."},{"number":15,"term":"instructions for use","definition":"The information provided by the provider to inform the deployer of, in particular, an AI system's intended purpose and proper use."},{"number":16,"term":"recall of an AI system","definition":"Any measure aiming to achieve the return to the provider or taking out of service or disabling the use of an AI system made available to deployers."},{"number":17,"term":"withdrawal of an AI system","definition":"Any measure aiming to prevent an AI system in the supply chain being made available on the market."},{"number":18,"term":"performance of an AI system","definition":"The ability of an AI system to achieve its intended purpose."},{"number":19,"term":"notifying authority","definition":"The national authority responsible for setting up and carrying out the necessary procedures for the assessment, designation and notification of conformity assessment bodies and for their monitoring."},{"number":20,"term":"conformity assessment","definition":"The process of demonstrating whether the requirements set out in Chapter III, Section 2 relating to a high-risk AI system have been fulfilled."},{"number":21,"term":"conformity assessment body","definition":"A body that performs third-party conformity assessment activities, including testing, certification and inspection."},{"number":22,"term":"notified body","definition":"A conformity assessment body notified in accordance with this Regulation and other relevant Union harmonisation legislation."},{"number":23,"term":"substantial modification","definition":"A change to an AI system after its placing on the market or putting into service which is not foreseen or planned in the initial conformity assessment carried out by the provider and as a result of which the compliance of the AI system with the requirements set out in Chapter III, Section 2 is affected or the intended purpose for which the AI system has been assessed is modified."},{"number":24,"term":"CE marking","definition":"A marking by which a provider indicates that an AI system is in conformity with the requirements set out in Chapter III, Section 2 and other applicable Union harmonisation legislation providing for its affixing."},{"number":25,"term":"post-market monitoring system","definition":"All activities carried out by providers of AI systems to collect and review experience gained from the use of AI systems they place on the market or put into service for the purpose of identifying any need to immediately apply any necessary corrective or preventive actions."},{"number":26,"term":"market surveillance authority","definition":"The national authority carrying out the activities and taking the measures pursuant to Regulation (EU) 2019/1020."},{"number":27,"term":"harmonised standard","definition":"A harmonised standard as defined in Article 2(1), point (c), of Regulation (EU) No 1025/2012."},{"number":28,"term":"common specification","definition":"A set of technical specifications, as defined in Article 2, point (4) of Regulation (EU) No 1025/2012, providing means to comply with certain requirements established under this Regulation."},{"number":29,"term":"training data","definition":"Data used for training an AI system through fitting its learnable parameters."},{"number":30,"term":"validation data","definition":"Data used for providing an evaluation of the trained AI system and for tuning its non-learnable parameters, including its hyperparameters."},{"number":31,"term":"validation data set","definition":"A separate data set or part of the training data set, either as a fixed or variable split."},{"number":32,"term":"testing data","definition":"Data used for providing an independent evaluation of the AI system in order to confirm the expected performance of that AI system before its placing on the market or putting into service."},{"number":33,"term":"input data","definition":"Data provided to or directly acquired by an AI system on the basis of which the system produces an output."},{"number":34,"term":"biometric data","definition":"Personal data resulting from specific technical processing relating to the physical, physiological or behavioural characteristics of a natural person, such as facial images or dactyloscopic data."},{"number":35,"term":"biometric identification","definition":"The automated recognition of physical, physiological, behavioural, or psychological human features for the purpose of establishing the identity of a natural person by comparing biometric data of that individual to biometric data of individuals stored in a database."},{"number":36,"term":"biometric verification","definition":"The automated, one-to-one verification, including authentication, of the identity of natural persons by comparing their biometric data to previously provided biometric data."},{"number":37,"term":"special categories of personal data","definition":"The categories of personal data referred to in Article 9(1) of Regulation (EU) 2016/679, Article 10 of Directive (EU) 2016/680 and Article 10(1) of Regulation (EU) 2018/1725."},{"number":38,"term":"sensitive operational data","definition":"Operational data related to activities of prevention, detection, investigation or prosecution of criminal offences, the disclosure of which could jeopardise the integrity of criminal proceedings."},{"number":39,"term":"emotion recognition system","definition":"An AI system for the purpose of identifying or inferring emotions or intentions of natural persons on the basis of their biometric data."},{"number":40,"term":"biometric categorisation system","definition":"An AI system for the purpose of assigning natural persons to specific categories on the basis of their biometric data, unless it is ancillary to another commercial service and strictly necessary for objective technical reasons."},{"number":41,"term":"remote biometric identification system","definition":"An AI system for the purpose of identifying natural persons, without their active involvement, typically at a distance through the comparison of a person's biometric data with the biometric data contained in a reference database."},{"number":42,"term":"real-time remote biometric identification system","definition":"A remote biometric identification system, whereby the capturing of biometric data, the comparison and the identification all occur without a significant delay, comprising not only instant identification, but also limited short delays in order to avoid circumvention."},{"number":43,"term":"post remote biometric identification system","definition":"A remote biometric identification system other than a real-time remote biometric identification system."},{"number":44,"term":"publicly accessible space","definition":"Any publicly or privately owned physical place accessible to an undetermined number of natural persons, regardless of whether certain conditions for access may apply, and regardless of the potential capacity restrictions."},{"number":45,"term":"law enforcement authority","definition":"Any public authority competent for the prevention, investigation, detection or prosecution of criminal offences or the execution of criminal penalties, including the safeguarding against and the prevention of threats to public security; or any other body or entity entrusted by Member State law to exercise public authority and public powers for the purposes of the prevention, investigation, detection or prosecution of criminal offences or the execution of criminal penalties."},{"number":46,"term":"law enforcement","definition":"Activities carried out by law enforcement authorities or on their behalf for the prevention, investigation, detection or prosecution of criminal offences or the execution of criminal penalties, including safeguarding against and preventing threats to public security."},{"number":47,"term":"AI Office","definition":"The Commission's function of contributing to the implementation, monitoring and supervision of AI systems and general-purpose AI models, and AI governance, provided for in Commission Decision of 24 January 2024."},{"number":48,"term":"national competent authority","definition":"A notifying authority or a market surveillance authority; as regards AI systems put into service or used by Union institutions, agencies, offices and bodies, references to national competent authorities or market surveillance authorities in this Regulation shall be construed as references to the European Data Protection Supervisor."},{"number":49,"term":"serious incident","definition":"An incident or malfunctioning of an AI system that directly or indirectly leads to: (a) death or serious harm to health; (b) serious disruption of critical infrastructure; (c) infringement of fundamental rights obligations; (d) serious harm to property or environment."},{"number":50,"term":"personal data","definition":"Personal data as defined in Article 4, point (1), of Regulation (EU) 2016/679 (GDPR)."},{"number":51,"term":"non-personal data","definition":"Data other than personal data as defined in Article 4, point (1), of Regulation (EU) 2016/679."},{"number":52,"term":"profiling","definition":"Profiling as defined in Article 4, point (4), of Regulation (EU) 2016/679 (GDPR)."},{"number":53,"term":"real-world testing plan","definition":"A document that describes the objectives, methodology, geographical, population and temporal scope, monitoring, organisation and conduct of testing in real-world conditions."},{"number":54,"term":"sandbox plan","definition":"A document agreed between the participating provider and the competent authority describing the objectives, conditions, timeframe, methodology and requirements for the activities carried out within the sandbox."},{"number":55,"term":"AI regulatory sandbox","definition":"A controlled framework set up by a competent authority which offers providers or prospective providers of AI systems the possibility to develop, train, validate and test, where appropriate in real-world conditions, an innovative AI system, pursuant to a sandbox plan for a limited time under regulatory supervision."},{"number":56,"term":"AI literacy","definition":"Skills, knowledge and understanding that allow providers, deployers and affected persons, taking into account their respective rights and obligations in the context of this Regulation, to make an informed deployment of AI systems, as well as to gain awareness about the opportunities and risks of AI and possible harm it can cause."},{"number":57,"term":"testing in real-world conditions","definition":"The temporary testing of an AI system for its intended purpose in real-world conditions outside a laboratory or otherwise simulated environment, with a view to gathering reliable and robust data and to assessing and verifying the conformity of the AI system with the requirements of this Regulation."},{"number":58,"term":"subject","definition":"For the purpose of real-world testing, a natural person who participates in testing in real-world conditions."},{"number":59,"term":"informed consent","definition":"A subject's freely given, specific, unambiguous and voluntary expression of his or her willingness to participate in a particular testing in real-world conditions, after having been informed of all aspects of the testing that are relevant to the subject's decision to participate."},{"number":60,"term":"deep fake","definition":"AI-generated or manipulated image, audio or video content that resembles existing persons, objects, places, entities or events and would falsely appear to a person to be authentic or truthful."},{"number":61,"term":"widespread infringement","definition":"Any act or omission contrary to Union law protecting the interest of individuals that has harmed or is likely to harm the collective interests of individuals residing in at least two Member States."},{"number":62,"term":"critical infrastructure","definition":"Critical infrastructure as defined in Article 2, point (4), of Directive (EU) 2022/2557."},{"number":63,"term":"general-purpose AI model","definition":"An AI model, including where such an AI model is trained with a large amount of data using self-supervision at scale, that displays significant generality and is capable of competently performing a wide range of distinct tasks regardless of the way the model is placed on the market and that can be integrated into a variety of downstream systems or applications."},{"number":64,"term":"high-impact capabilities","definition":"Capabilities that match or exceed the capabilities recorded in the most advanced general-purpose AI models."},{"number":65,"term":"systemic risk","definition":"A risk that is specific to the high-impact capabilities of general-purpose AI models, having a significant impact on the Union market due to their reach, or due to actual or reasonably foreseeable negative effects on public health, safety, public security, fundamental rights, or the society as a whole, that can be propagated at scale across the value chain."},{"number":66,"term":"general-purpose AI system","definition":"An AI system which is based on a general-purpose AI model and which has the capability to serve a variety of purposes, both for direct use as well as for integration in other AI systems."},{"number":67,"term":"floating-point operation","definition":"Any mathematical operation or assignment involving floating-point numbers, which are a subset of the real numbers typically represented on computers by an integer of fixed precision scaled by an integer exponent of a fixed base."},{"number":68,"term":"downstream provider","definition":"A provider of an AI system, including a general-purpose AI system, which integrates an AI model, regardless of whether the AI model is provided by themselves and vertically integrated or provided by another entity based on contractual relations."}],"categories":{"core_concepts":[1,2,18],"market_actors":[3,4,5,6,7,8,68],"market_activities":[9,10,11,16,17],"product_requirements":[12,13,14,15,23,24],"conformity_and_standards":[19,20,21,22,25,26,27,28],"data_types":[29,30,31,32,33,50,51],"biometric_systems":[34,35,36,39,40,41,42,43],"sensitive_data":[37,38,52],"spaces_and_infrastructure":[44,62],"law_enforcement":[45,46],"governance_bodies":[47,48],"incidents_and_risks":[2,49,65],"testing_and_sandboxes":[53,54,55,57,58,59],"ai_literacy_and_awareness":[56],"synthetic_content":[60],"enforcement":[61],"general_purpose_ai":[63,64,65,66,67,68]}}